kepler-444b/GD_gd32e230c8t6/Source/device/panel_key.c
/* ***************************************** 按键类型 ***************************************** */
static void panel_all_close(FUNC_PARAMS) // 总关
{
    PROCESS_OUTER(temp_cfg, temp_status, {
        if ((BIT5(p_cfg->perm) == true) && // "睡眠"被勾选,"总开关分区"相同 或 0xF
            ((H_BIT(data->data[4]) == H_BIT(p_cfg->area)) || (H_BIT(data->data[4]) == 0xF))) {
            switch (p_cfg->func) {
                case ALL_CLOSE:
                    if (data->data[3] == p_cfg->group) {
                        panel_fast_exe(p_status, 0b00011010 | (data->data[2] & 0x01));
                    }
                    break;
                case NIGHT_LIGHT:
                case DND_MODE:
                    panel_fast_exe(p_status, 0b00010110 | (data->data[2] & 0x01));
                    break;
                case SCENE_MODE:
                case LIGHT_MODE:
                case ALL_ON_OFF:
                case CLEAN_ROOM:
                    panel_fast_exe(p_status, 0b00010110 | 0x00);
                    break;
                case CURTAIN_CLOSE: // 勾选"总关"的窗帘关
                    PROCESS_INNER(temp_cfg, temp_status, {
                        if (p_cfg_ex->func == CURTAIN_OPEN &&
                            p_cfg_ex->group == p_cfg->group) {
                            panel_fast_exe(p_status_ex, 0b00110000 | 0x00);
                        }
                    });
                    // p_status->relay_open_count = 0; // 提前置0,以重置当前正在执行的"短开"
                    panel_fast_exe(p_status, 0b00101010 | 0x01);
                    break;
                default:
                    break;
            }
        }
    });
}

static void panel_all_on_off(FUNC_PARAMS) // 总开关
{
    PROCESS_OUTER(temp_cfg, temp_status, {
        if ((BIT0(p_cfg->perm) == true) && // "总开关"被勾选,"总开关分区"相同 或 0xF
            ((H_BIT(data->data[4]) == H_BIT(p_cfg->area)) || (H_BIT(data->data[4]) == 0xF))) {
            switch (p_cfg->func) {
                case ALL_ON_OFF:
                    if (data->data[3] == p_cfg->group) {
                        panel_fast_exe(p_status, 0b00010110 | (data->data[2] & 0x01));
                    }
                    break;
                case NIGHT_LIGHT:
                case DND_MODE:
                    panel_fast_exe(p_status, 0b00010110 | (~data->data[2] & 0x01));
                    break;
                case LIGHT_MODE:
                case CLEAN_ROOM:
                    panel_fast_exe(p_status, 0b00010110 | (data->data[2] & 0x01));
                    break;
                case ALL_CLOSE:
                    panel_fast_exe(p_status, 0b00011010 | (data->data[2] & 0x01));
                    break;
                case CURTAIN_CLOSE: // 勾选"总开关"的窗帘关
                    if (data->data[2] == false) {
                        PROCESS_INNER(temp_cfg, temp_status, {
                            if (p_cfg_ex->func == CURTAIN_OPEN &&
                                p_cfg_ex->group == p_cfg->group) {
                                panel_fast_exe(p_status_ex, 0b00110000 | 0x00);
                            }
                        });
                        panel_fast_exe(p_status, 0b00101010 | 0x01);
                    }
                    break;
                case CURTAIN_OPEN: // 勾选"总开关"的窗帘开
                    if (data->data[2] == true) {
                        PROCESS_INNER(temp_cfg, temp_status, {
                            if (p_cfg_ex->func == CURTAIN_CLOSE &&
                                p_cfg_ex->group == p_cfg->group) {
                                panel_fast_exe(p_status_ex, 0b00110000 | 0x00);
                            }
                        });
                        panel_fast_exe(p_status, 0b00101010 | 0x01);
                    }
                    break;
                default:
                    break;
            }
        }
    });
}

static void panel_clean_room(FUNC_PARAMS) // 清理房间
{
    PROCESS_OUTER(temp_cfg, temp_status, {
        if (p_cfg->func == CLEAN_ROOM &&
            (data->data[3] == p_cfg->group || data->data[3] == 0xFF)) {
            if (data->data[2] == true) {
                PROCESS_INNER(temp_cfg, temp_status, {
                    if (p_cfg_ex->func == DND_MODE &&
                        (data->data[3] == p_cfg_ex->group || data->data[3] == 0xFF)) {
                        panel_fast_exe(p_status_ex, 0b00010110 | (~data->data[2] & 0x01));
                    }
                });
            }
            panel_fast_exe(p_status, 0b00010110 | (data->data[2] & 0x01));
        }
    });
}

static void panel_dnd_mode(FUNC_PARAMS) // 勿扰模式
{
    PROCESS_OUTER(temp_cfg, temp_status, {
        if (p_cfg->func == DND_MODE &&
            (data->data[3] == p_cfg->group || data->data[3] == 0xFF)) {
            if (data->data[2] == true) {
                PROCESS_INNER(temp_cfg, temp_status, {
                    if (p_cfg_ex->func == CLEAN_ROOM &&
                        (data->data[3] == p_cfg_ex->group || data->data[3] == 0xFF)) {
                        panel_fast_exe(p_status_ex, 0b00010110 | (~data->data[2] & 0x01));
                    }
                });
            }
            panel_fast_exe(p_status, 0b00010110 | (data->data[2] & 0x01));
        }
    });
}

static void panel_later_mode(FUNC_PARAMS) // 请稍后
{
    PROCESS_OUTER(temp_cfg, temp_status, {
        if (p_cfg->func == LATER_MODE &&
            (data->data[3] == p_cfg->group || data->data[3] == 0xFF)) {
            panel_fast_exe(p_status, 0b00100110 | (data->data[2] & 0x01));
        }
    });
}

static void panel_chect_out(FUNC_PARAMS) // 退房
{
    PROCESS_OUTER(temp_cfg, temp_status, {
        if (p_cfg->func == CHECK_OUT &&
            (data->data[3] == p_cfg->group || data->data[3] == 0xFF)) {
            panel_fast_exe(p_status, 0b00010110 | (data->data[2] & 0x01));
        }
    });
}

static void panel_sos_mode(FUNC_PARAMS) // 紧急呼叫
{
    PROCESS_OUTER(temp_cfg, temp_status, {
        if (p_cfg->func == SOS_MODE &&
            (data->data[3] == p_cfg->group || data->data[3] == 0xFF)) {
            panel_fast_exe(p_status, 0b00010110 | (data->data[2] & 0x01));
        }
    });
}

static void panel_service(FUNC_PARAMS) // 请求服务
{
    PROCESS_OUTER(temp_cfg, temp_status, {
        if (p_cfg->func == SERVICE &&
            (data->data[3] == p_cfg->group || data->data[3] == 0xFF)) {
            panel_fast_exe(p_status, 0b00010110 | (data->data[2] & 0x01));
        }
    });
}

