kepler-444b/GD_gd32e230c8t6/Source/device/panel_key.c
static void panel_curtain_open(FUNC_PARAMS) // 窗帘开
{
    PROCESS_OUTER(temp_cfg, temp_status, {
        if (p_cfg->func == CURTAIN_OPEN &&
            (data->data[3] == p_cfg->group || data->data[3] == 0xFF)) {
            PROCESS_INNER(temp_cfg, temp_status, {
                if (p_cfg_ex->func == CURTAIN_CLOSE &&
                    (data->data[3] == p_cfg_ex->group || data->data[3] == 0xFF)) {
                    panel_fast_exe(p_status_ex, 0b00110000 | 0x00);
                }
            });
            panel_fast_exe(p_status, 0b00101010 | 0x01);
        }
    });
}

static void panel_curtain_close(FUNC_PARAMS) // 窗帘关
{
    PROCESS_OUTER(temp_cfg, temp_status, {
        if (p_cfg->func == CURTAIN_CLOSE &&
            (data->data[3] == p_cfg->group || data->data[3] == 0xFF)) {
            PROCESS_INNER(temp_cfg, temp_status, {
                if (p_cfg_ex->func == CURTAIN_OPEN &&
                    (data->data[3] == p_cfg_ex->group || data->data[3] == 0xFF)) {
                    panel_fast_exe(p_status_ex, 0b00110000 | 0x00);
                }
            });
            panel_fast_exe(p_status, 0b00101010 | 0x01);
        }
    });
}

static void panel_curtain_stop(FUNC_PARAMS) // 窗帘停
{
    PROCESS_OUTER(temp_cfg, temp_status, {
        if (((p_cfg->func == CURTAIN_OPEN) || (p_cfg->func == CURTAIN_CLOSE)) &&
            (data->data[3] == p_cfg->group || data->data[3] == 0xFF) &&
            p_status->relay_short == true) {
            panel_fast_exe(p_status, 0b00111010 | 0x00);
        }
    });
}

static void panel_scene_mode(FUNC_PARAMS) // 场景模式
{
    PROCESS_OUTER(temp_cfg, temp_status, {
        if (((L_BIT(data->data[4]) == L_BIT(p_cfg->area)) ||
             (L_BIT(data->data[4]) == 0xF))) { // 匹配场景区域

            panel_fast_exe(p_status, 0b00010110 | 0x00);       // 关闭该场景区域所有的按键
            uint8_t mask = data->data[7] & p_cfg->scene_group; // 找出两个字节中同为1的位

            if (mask != 0) { // 任意一位同为1,说明勾选了该场景分组,执行动作
                switch (p_cfg->func) {
                    case CURTAIN_OPEN: // 勾选此场景的"窗帘开"
                        if (data->data[2] == true) {
                            PROCESS_INNER(temp_cfg, temp_status, {
                                if (p_cfg_ex->func == CURTAIN_CLOSE &&
                                    p_cfg_ex->group == p_cfg->group) {
                                    panel_fast_exe(p_status_ex, 0b00110000 | 0x00);
                                }
                            });
                            panel_fast_exe(p_status, 0b00101010 | 0x01);
                        }
                        break;
                    case CURTAIN_CLOSE: // 勾选此场景的"窗帘关"
                        if (data->data[2] == false) {
                            PROCESS_INNER(temp_cfg, temp_status, {
                                if (p_cfg_ex->func == CURTAIN_OPEN &&
                                    (data->data[3] == p_cfg_ex->group || data->data[3] == 0xFF)) {
                                    panel_fast_exe(p_status_ex, 0b00110000 | 0x00);
                                }
                            });
                            panel_fast_exe(p_status, 0b00101010 | 0x01);
                        }
                        break;
                    case LIGHT_MODE: // 勾选此场景的"灯控模式"
                        panel_fast_exe(p_status, 0b00010110 | (data->data[2] & 0x01));
                        break;
                    case SCENE_MODE: // 勾选此场景的"场景按键"
                        panel_fast_exe(p_status, 0b00010110 | (data->data[2] & 0x01));
                        break;
                    default:
                        break;
                }
            }
        }
    });
}

static void panel_light_mode(FUNC_PARAMS) // 灯控模式
{
    PROCESS_OUTER(temp_cfg, temp_status, {
        if (p_cfg->func == LIGHT_MODE &&
            (data->data[3] == p_cfg->group || data->data[3] == 0xFF)) {
            panel_fast_exe(p_status, 0b00010110 | (data->data[2] & 0x01));
        }
    });
}

static void panel_night_light(FUNC_PARAMS) // 夜灯
{
    PROCESS_OUTER(temp_cfg, temp_status, {
        if (p_cfg->func == NIGHT_LIGHT &&
            (data->data[3] == p_cfg->group || data->data[3] == 0xFF)) {
            panel_fast_exe(p_status, 0b00010110 | (data->data[2] & 0x01));
        }
    });
}
#endif